Revit 2024 API
FabricationConfiguration.LocateMaterial Method
 Gets material by group and name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int LocateMaterial(
	string group,
	string name
)
Visual Basic
Public Function LocateMaterial ( _
	group As String, _
	name As String _
) As Integer
Visual C++
public:
int LocateMaterial(
	String^ group,
	String^ name
)
Parameters
group
Type: System.String
 The material group.
name
Type: System.String
 The group name.
Return Value
 The material identifier. Returns -1 if not found.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace